Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition Constructor (Identifier)
 Creates a new input definition instance with one identifier.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Identifier ID
)
Public Sub New (
	ID As Identifier
)
Parameters
ID
Type: Tekla.Structures.Identifier
The model object identifier.
See Also
Reference
PluginBase.InputDefinition Class
PluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace